Revit 2023 API
ExternalServiceOptions Members
The ExternalServiceOptions type exposes the following members.
Constructors
Name | Description
ExternalServiceOptions
 Constructs a new ExternalServiceOptions with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalServiceOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsPublic
 This property denotes a service as either public or private.
IsRecordable
 Indicates whether executions of the service is recorded in documents or not.
IsSelfsynchronizing
 Indicates whether the service's record of used services (in a particular document) can independently wary between local clients and the corresponding central model. It is then up to the service's owner to assure proper local-central synchronization.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace